DataProcessors/Лео_СогласованиеКомпенсирующихСкидок/Лео_СогласованиеКомпенсирующихСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Лео_СогласованиеКомпенсирующихСкидок</name>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйОтчет</name>
    <type>
      <types>CatalogRef.ПроизвольныеОтчеты</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяНастройка</name>
    <type>
      <types>CatalogRef.СохраненныеНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаДляСогласования</name>
    <type>
      <types>EnumRef.абс_ТипыДокументовДляСогласования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыДляСогласования</name>
    <attributes>
      <name>ДокументДляСогласования</name>
      <type>
        <types>DocumentRef.абс_ВводБюджета</types>
        <types>DocumentRef.абс_СтратегическиеЦелиПродаж</types>
        <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
        <types>DocumentRef.ПланПродаж</types>
        <types>DocumentRef.абс_ЗаявкаНаБюджетОтделаТМ</types>
        <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееСостояние</name>
      <type>
        <types>EnumRef.СостоянияОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоследнийСогласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Enums/СостоянияОбъектов/СостоянияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбъектов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>абс_Проведен</name>
    <comment>Оплачен</comment>
  </enumValues>
  <enumValues>
    <name>Лео_ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Лео_КОплате</name>
  </enumValues>
  <enumValues>
    <name>Лео_Завершен</name>
  </enumValues>
  <enumValues>
    <name>Лео_Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Лео_ПроверенФакт</name>
  </enumValues>
</mdclass:Enum>

DataProcessors/Лео_СогласованиеКомпенсирующихСкидок/Forms/ФормаУправляемая/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Документы для согласования

&НаКлиенте
Функция ПолучитьТекущуюСтрокуСписка()
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено 
		ИЛИ ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТекущаяСтрока;
	
КонецФункции // 

&НаКлиенте
Процедура ОткрытьФормуВыбранногоДокумента()

	ТекущаяСтрока = ПолучитьТекущуюСтрокуСписка();
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ТекущиеДанные.Ссылка.ПолучитьФорму().Открыть();
	
КонецПроцедуры //

&НаКлиенте
Процедура ИзменитьСтатусДокументов(НовоеСостояние)

	Объект.ДокументыДляСогласования.Очистить();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого ИндексСтроки ИЗ ВыделенныеСтроки Цикл
		Если ТипЗнч(ИндексСтроки) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ИндексСтроки);
		
		ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(ДанныеСтроки.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
		Если ПараметрыФормы = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + ДанныеСтроки.Ссылка + " не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти = Объект.ДокументыДляСогласования.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеСтроки);
		СтрокаТабличнойЧасти.ДокументДляСогласования = ДанныеСтроки.Ссылка;

		
		СтрокаТабличнойЧасти.Пометка = Истина;
		СтрокаТабличнойЧасти.ДокументДляСогласования = ДанныеСтроки.Ссылка;
		СтрокаТабличнойЧасти.ТекущееСостояние = ДанныеСтроки.Состояние;
	КонецЦикла;
	
	Если Объект.ДокументыДляСогласования.Количество() = 0 Тогда
		Предупреждение(НСтр("ru = 'Не выбрано ни одного документа'"));
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект);
	ПараметрыФормы.Вставить("НовоеСостояние", НовоеСостояние);
	ПараметрыФормы.Вставить("ДокументыДляСогласования", Объект.ДокументыДляСогласования);
	
	СвойстваОбъекта = Новый Структура;
	СвойстваОбъекта.Вставить("ТекущийПользователь",  Объект.ТекущийПользователь);
	СвойстваОбъекта.Вставить("ПроизвольныйОтчет",    Объект.ПроизвольныйОтчет);
	СвойстваОбъекта.Вставить("СохраненнаяНастройка", Объект.СохраненнаяНастройка);
	
	ПараметрыФормы.Вставить("СвойстваОбъекта",  СвойстваОбъекта);
	
	ОткрытьФорму("Обработка.Лео_СогласованиеКомпенсирующихСкидок.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбранногоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьФормуВыбранногоДокумента();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура Отклонить(Команда)
	
	ИзменитьСтатусДокументов(СостоянияОбъектовОтклонен);
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	
	ИзменитьСтатусДокументов(СостоянияОбъектовОтложен);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	
	ИзменитьСтатусДокументов(СостоянияОбъектовСогласован);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтчета(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПроизвольныйОтчет", Объект.ПроизвольныйОтчет);
	ПараметрыФормы.Вставить("СохраненнаяНастройка", Объект.СохраненнаяНастройка);
	
	РезультатНастройки = ОткрытьФормуМодально("Обработка.абс_СогласованиеДокументов.Форма.НастройкаОтчета", ПараметрыФормы);
	Если РезультатНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПроизвольныйОтчет = РезультатНастройки.ПроизвольныйОтчет;
	Объект.СохраненнаяНастройка   = РезультатНастройки.СохраненнаяНастройка;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ФОРМА

&НаСервере
Процедура ВосстановитьНастройкиОтборов(ДанныеОтбора)
	
	Список.Отбор.Элементы.Очистить();
	
	Если ДанныеОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТиповыеОтчеты.СкопироватьЭлементы(Список.Отбор, ДанныеОтбора);

КонецПроцедуры

// В процедуре инициализируются значения констант формы
// Константы используются при выполнении модуля формы
//
&НаСервере
Процедура УстановитьЗначенияКонстантФормы()
	
	СостоянияОбъектовСогласован = Перечисления.СостоянияОбъектов.Согласован;
	СостоянияОбъектовОтклонен   = Перечисления.СостоянияОбъектов.Отклонен;
	СостоянияОбъектовОтложен    = Перечисления.СостоянияОбъектов.Отложен;
	
	Объект.ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	
КонецПроцедуры //

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияКонстантФормы();
	
	//Если Объект.ТипДокументаДляСогласования.Пустая() Тогда
	//	Объект.ТипДокументаДляСогласования=Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета;
	//КонецЕсли;
	
	ЭтапыСогласования = абс_СогласованиеДокументов.ПолучитьЭтапыСогласованияПользователя(Объект.ТекущийПользователь);
	СписокЭтапов = абс_СогласованиеДокументов.ПолучитьЭтапыМаршрутовВКоторыхУчаствуетПользователь(ЭтапыСогласования, Объект.ТекущийПользователь);
	
	Список.Параметры.УстановитьЗначениеПараметра("ЭтапыСогласованияПользователя", ЭтапыСогласования);
	Список.Параметры.УстановитьЗначениеПараметра("ЭтапыМаршрутовВКоторыхУчаствуетПользователь", СписокЭтапов);
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекПользователь", Объект.ТекущийПользователь);
	
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеСогласован",  Перечисления.СостоянияОбъектов.Согласован);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеУтвержден",   Перечисления.СостоянияОбъектов.Утвержден);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеОтложен",     Перечисления.СостоянияОбъектов.Отложен);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеОтклонен",    Перечисления.СостоянияОбъектов.Отклонен);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеПодготовлен", Перечисления.СостоянияОбъектов.Подготовлен);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеПроведен", 	 Перечисления.СостоянияОбъектов.абс_Проведен);
	
	Список.Параметры.УстановитьЗначениеПараметра("ТипДокументаДляСогласования", Объект.ТипДокументаДляСогласования);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СтатусДокументовБылИзменен" Тогда
		Элементы.Список.Обновить();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("ОтборСписка", Список.Отбор);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ВосстановитьНастройкиОтборов(Настройки.Получить("ОтборСписка"));
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаДляСогласованияОчистка(Элемент, СтандартнаяОбработка)
//	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаДляСогласованияПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ТипДокументаДляСогласования", Объект.ТипДокументаДляСогласования);
КонецПроцедуры
